#+STARTUP: content
#+PROPERTY: header-args+ :mkdirp yes

*** essid

    Get currently connected ssid.

    #+BEGIN_SRC bash :tangle ~/.bin/essid
      ssid=$((iwgetid || echo "no wifi") | cut -d\" -f2)
      echo $ssid
    #+END_SRC

    #+RESULTS:
    : Lan Before Time

** Bashrc
   :PROPERTIES:
   :header-args:bash: :tangle ~/.bashrc :comments org :padline no
   :END:

   If not running interactively, don't do anything

   #+BEGIN_SRC bash
     [[ $- != *i* ]] && return
   #+END_SRC

   Include scripts tangled from [[*Misc Scripts]]

   #+BEGIN_SRC bash
     export PATH=$PATH:$HOME/.bin/
   #+END_SRC

   Set editor to script tangled from [[*editor]].

   #+BEGIN_SRC bash
     export EDITOR=editor
   #+END_SRC

   Go related settings. Using a non-standard go path.

   #+BEGIN_SRC bash
     export GOPATH=$HOME/.go
     export PATH=$PATH:$HOME/.go/bin
   #+END_SRC

   Stack installs binaries here. Needed since I'm using stack to manage xmonad.

   #+BEGIN_SRC bash
     export PATH=$PATH:$HOME/.local/bin
   #+END_SRC

   Get the number of threads by counting occurrences of "processor" in cpu info.

   #+name: num-threads
   #+BEGIN_SRC bash :tangle no
     grep -c ^processor /proc/cpuinfo
   #+END_SRC

   #+RESULTS:
   : 16

   Set number of threads for julia to the number of threads counted by the
   machine tangling this file.

   #+BEGIN_SRC bash :noweb yes
     export JULIA_NUM_THREADS=<<num-threads()>>
   #+END_SRC

   Include cargo binaries in path.

   #+BEGIN_SRC bash
     export PATH=$PATH:$HOME/.cargo/bin
   #+END_SRC

   Include [[https://github.com/leanprover/elan][elan]] binaries in path.

   #+BEGIN_SRC bash
     export PATH=$PATH:$HOME/.elan/bin
   #+END_SRC

   I like colors in my =ls= output.

   #+BEGIN_SRC bash
     alias ls='ls --color=auto'
   #+END_SRC

   Set prompt.

   #+BEGIN_SRC bash
     PS1='[\u@\h \W]\$ '
   #+END_SRC

* Fonts

  List of fonts to be used elsewhere.

  #+name: font-serif
  #+BEGIN_SRC sh
    echo "Source Serif Pro"
  #+END_SRC

  #+RESULTS: font-serif
  : Source Serif Pro

  #+name: font-sans-serif
  #+BEGIN_SRC sh
    echo "Source Sans Pro"
  #+END_SRC

  #+RESULTS: font-sans-serif
  : Source Sans Pro

  #+name: font-monospace
  #+BEGIN_SRC sh
    echo "PragmataPro Mono"
  #+END_SRC

  #+RESULTS: font-monospace
  : PragmataPro Mono

** Iosevka build

   #+BEGIN_SRC sh
     git clone "https://github.com/be5invis/Iosevka" ~/Code/github.com/be5invis/Iosevka --depth 1
   #+END_SRC

   #+RESULTS:

   #+BEGIN_SRC sh
     cd ~/Code/github.com/be5invis/Iosevka && git rev-parse HEAD
   #+END_SRC

   #+RESULTS:
   : fa8166b05776288eb57613dbce54ef256c4c5034

   #+name: iosevka-build-plan
   #+BEGIN_SRC toml
     [buildPlans.iosevka-custom]
     family = "Iosevka Custom"
     spacing = "fixed"
     serifs = "sans"
     no-cv-ss = false

     [buildPlans.iosevka-custom.variants.design]
     asterisk = "penta-low"
     number-sign = "slanted-open"
     dollar = "open"
     cent = "open"
     percent = "rings-continuous-slash"
     zero = "slashed-split"
     ampersand = "upper-open"
     g = "double-storey"

     [buildPlans.iosevka-custom.metric-override]
     leading = 1200
   #+END_SRC

   Build the ttf files with the build plan. Requires =ttfautohint= to be
   installed (can be installed from the AUR).

   #+BEGIN_SRC sh :noweb yes
     cd ~/Code/github.com/be5invis/Iosevka &&
         echo '
     <<iosevka-build-plan>>
     ' > private-build-plans.toml
   #+END_SRC

   #+RESULTS:

   #+BEGIN_SRC emacs-lisp :noweb yes
     (let ((default-directory "~/Code/github.com/be5invis/Iosevka")
           (cmd (string-join '("npm install"
                               "npm run build -- ttf::iosevka-custom"
                               "cp -r dist/iosevka-custom ~/syncthing/config/fonts/.")
                             "&&")))
       (async-shell-command cmd "*Iosevka build*"))
   #+END_SRC

   #+RESULTS:
   : #<window 15 on *Iosevka build*>

* X

  Common fonts used throughout.

  #+name: ui-font-size
  #+BEGIN_SRC shell
    echo 11
  #+END_SRC

  #+RESULTS: ui-font-size
  : 10

  #+name: ui-font-weight
  #+BEGIN_SRC shell
    echo semibold
  #+END_SRC

  #+RESULTS: ui-font-weight
  : regular

  #+name: xft-ui-font
  #+BEGIN_SRC shell :noweb yes
    echo "xft:<<font-sans-serif()>>:<<ui-font-weight()>>:size=<<ui-font-size()>>"
  #+END_SRC

  #+RESULTS: xft-ui-font
  : xft:Source Sans Pro:semibold:size=10

  Common colors used throughout.

  #+name: ui-dark-color
  #+BEGIN_SRC shell
    echo "#36373d"
  #+END_SRC

  #+RESULTS: ui-dark-color
  : #46474d

  #+name: ui-fg-color
  #+BEGIN_SRC shell
    echo "#ababb4"
  #+END_SRC

  #+RESULTS: ui-fg-color
  : #ababb4

  #+name: ui-fg-muted-color
  #+BEGIN_SRC shell
    echo "#828282"
  #+END_SRC

  #+RESULTS: ui-fg-muted-color
  : #828282

  #+name: ui-fg-highlight-color
  #+BEGIN_SRC shell
    echo "#fcfcfc"
  #+END_SRC

  #+RESULTS: ui-fg-highlight-color
  : #fcfcfc

  #+name: ui-border-color
  #+BEGIN_SRC shell
    echo "#26272d"
  #+END_SRC

  #+RESULTS: ui-border-color
  : #26272d

*** Xmonad

    Xmonad is managed via =stack=.

    Clone required repos.

    #+BEGIN_SRC bash :results output
      mkdir -p ~/.xmonad
      if [ ! -d ~/.xmonad/xmonad-git/ ]; then
         git clone "https://github.com/xmonad/xmonad" ~/.xmonad/xmonad-git 2>&1
      fi

      if [ ! -d ~/.xmonad/xmonad-contrib-git/ ]; then
         git clone "https://github.com/xmonad/xmonad-contrib" ~/.xmonad/xmonad-contrib-git 2>&1
      fi
    #+END_SRC

    #+RESULTS:
    : Cloning into '/home/sean/.xmonad/xmonad-git'...
    : Cloning into '/home/sean/.xmonad/xmonad-contrib-git'...

    Get commit info.

    #+BEGIN_SRC shell
      (cd ~/.xmonad/xmonad-git/ && git rev-parse HEAD)
      (cd ~/.xmonad/xmonad-contrib-git/ && git rev-parse HEAD)
    #+END_SRC

    #+RESULTS:
    | 33a86c0cdb9aa481e23cc5527a997adef5e32d42 |
    | f821a2ec0c567fc7ebff438410fd566d67480593 |

    Stack configuration.

    #+BEGIN_SRC yaml :tangle ~/.xmonad/stack.yaml
      resolver:
        url: https://raw.githubusercontent.com/commercialhaskell/stackage-snapshots/master/lts/18/13.yaml

      # Git packages.
      packages:
        - xmonad-git
        - xmonad-contrib-git
    #+END_SRC

    Build file that's used when =xmonad --recompile= is called.

    #+BEGIN_SRC sh :tangle ~/.xmonad/build :tangle-mode (identity #o755)
      #!/bin/sh

      exec stack ghc --  \
          --make xmonad.hs \
          -i               \
          -ilib            \
          -fforce-recomp   \
          -main-is main    \
          -v0              \
          -o "$1"
    #+END_SRC

    Install xmonad. Installs to =~/.local/bin/=.

    #+BEGIN_SRC emacs-lisp :dir ~/.xmonad
      (async-shell-command "stack install" "*stack install [xmonad]*")
    #+END_SRC

    #+RESULTS:
    : #<window 11 on *stack install [xmonad]*>

    Window manager configuration.

    #+BEGIN_SRC haskell :tangle ~/.xmonad/xmonad.hs :noweb yes
      import qualified Data.List as List
      import qualified Data.Map as Map
      import qualified Data.Map.Strict as StrictMap
      import Graphics.X11.ExtraTypes.XF86
      import System.Exit
        ( ExitCode (ExitSuccess),
          exitWith,
        )
      import XMonad
      import XMonad.Actions.PhysicalScreens
        ( sendToScreen,
          viewScreen,
        )
      import qualified XMonad.Hooks.DynamicLog as D
      import XMonad.Hooks.EwmhDesktops
        ( ewmh,
          fullscreenEventHook,
        )
      import XMonad.Hooks.ManageDocks
        ( ToggleStruts (..),
          avoidStruts,
          docks,
        )
      import XMonad.Hooks.ManageHelpers
        ( Side (..),
          doCenterFloat,
          doSideFloat,
          isDialog,
        )
      import XMonad.Hooks.UrgencyHook
        ( NoUrgencyHook (..),
          withUrgencyHook,
        )
      import XMonad.Layout (Full (..), Tall (..))
      import XMonad.Layout.NoBorders
        ( Ambiguity (..),
          lessBorders,
        )
      import XMonad.Layout.Spacing
        ( Border (..),
          spacingRaw,
        )
      import XMonad.Prompt
      import XMonad.Prompt.Shell
      import qualified XMonad.StackSet as W
      import XMonad.Util.Run
        ( hPutStrLn,
          runProcessWithInput,
          spawnPipe,
        )
      import XMonad.Util.WorkspaceCompare (getSortByIndex)

      promptConf =
        def
          { position = Bottom,
            font = "<<xft-ui-font()>>",
            height = 44,
            bgColor = dark,
            fgColor = foreground,
            bgHLight = dark,
            fgHLight = highlight,
            promptBorderWidth = myPromptBorderWidth,
            borderColor = myPromptBorderColor,
            maxComplRows = Just 1,
            showCompletionOnTab = False
          }

      -- | Float and resize window to the center of the screen.
      centerWindow :: Window -> X ()
      centerWindow win = do
        (_, W.RationalRect x y w h) <- floatLocation win
        let newH = 11 / 12
        let newW = 3 / 5
        windows $
          W.float win (W.RationalRect ((1 - newW) / 2) ((1 - newH) / 2) newW newH)
        return ()

      myWorkspaceKeys conf@(XConfig {XMonad.modMask = modMask}) =
        Map.fromList $
          [ ((modMask, xK_Return), spawn myTerminal),
            ((modMask, xK_p), shellPrompt promptConf),
            ((modMask, xK_b), spawn myBrowser),
            ((modMask, xK_v), spawn myEditor),
            ((modMask, xK_n), spawn "dunstctl history-pop"),
            ((modMask .|. shiftMask, xK_n), spawn "dunstctl close"),
            ((modMask, xK_q), spawn "lock"),
            ((modMask .|. shiftMask, xK_q), spawn "lock suspend"),
            ((modMask, xK_x), spawn "if type xmonad; then xmonad --restart; fi"),
            ((modMask .|. shiftMask, xK_x), io (exitWith ExitSuccess)),
            ((modMask .|. shiftMask, xK_c), kill),
            -- Layouts
            ((modMask, xK_space), sendMessage NextLayout),
            ((modMask .|. shiftMask, xK_space), setLayout $ XMonad.layoutHook conf),
            -- Move window focus
            ((modMask, xK_j), windows W.focusDown),
            ((modMask, xK_k), windows W.focusUp),
            ((modMask, xK_m), windows W.focusMaster),
            -- Modify the window order
            ((modMask .|. shiftMask, xK_j), windows W.swapDown),
            ((modMask .|. shiftMask, xK_k), windows W.swapUp),
            -- Resize windows
            ((modMask, xK_h), sendMessage Shrink),
            ((modMask, xK_l), sendMessage Expand),
            -- Floating layer
            ((modMask, xK_t), withFocused $ windows . W.sink),
            ((modMask, xK_f), withFocused $ centerWindow),
            -- Increase/decrease windos in master area
            ((modMask, xK_comma), sendMessage (IncMasterN 1)),
            ((modMask, xK_period), sendMessage (IncMasterN (-1)))
          ]
            ++
            -- Switch screens based on physical position (xrandr).
            [ ((m .|. modMask, key), f sc)
              | (key, sc) <- zip [xK_w, xK_e] [0 ..],
                (f, m) <- [(viewScreen def, 0), (sendToScreen def, shiftMask)]
            ]
            ++
            -- Switch workspaces.
            [ ((m .|. modMask, k), windows $ f i)
              | (i, k) <- zip (XMonad.workspaces conf) [xK_1 .. xK_9],
                (f, m) <- [(W.greedyView, 0), (W.shift, shiftMask)]
            ]
            ++
            -- Various function keys.
            [ ((0, xF86XK_MonBrightnessUp), spawn "bri laptop up"),
              ((0, xF86XK_MonBrightnessDown), spawn "bri laptop down"),
              ((0, xF86XK_AudioRaiseVolume), spawn "vol up"),
              ((0, xF86XK_AudioLowerVolume), spawn "vol down"),
              ((0, xF86XK_AudioMute), spawn "vol mute")
            ]

      stringifyLayout :: String -> String
      stringifyLayout l
        | t "Tall" l = fmt "tall"
        | t "Full" l = fmt "full"
        | otherwise = fmt l
        where
          t = List.isInfixOf
          fmt s = "[" ++ s ++ "]"

      myLogHook h = do
        let fmt fg bg = D.pad . D.xmobarColor fg bg
        D.dynamicLogWithPP
          D.xmobarPP
            { D.ppCurrent = fmt primary "",
              D.ppHidden = fmt muted "",
              D.ppVisible = fmt foreground "",
              D.ppUrgent = fmt urgent "",
              D.ppLayout = fmt muted "" . stringifyLayout,
              D.ppTitle = const "",
              D.ppSep = " ",
              D.ppSort = getSortByIndex,
              D.ppOutput = hPutStrLn h
            }

      myLayoutHook =
        uniformSpacing $
          lessBorders (OnlyScreenFloat) (tall ||| Full)
        where
          tall = Tall 1 (5 / 100) (1 / 2)
          gs = 5
          uniformSpacing = spacingRaw False (border) True (border) True
          border = Border gs gs gs gs

      myManageHook = composeAll [ isDialog =? True --> doCenterFloat
                                , className =? "Xmessage" --> doCenterFloat
                                , className =? "Pavucontrol" --> doCenterFloat
                                , fmap (List.isPrefixOf "zoom") className --> doCenterFloat ]

      myConfig pipe =
        withUrgencyHook NoUrgencyHook $
          ewmh $
            docks
              def
                { logHook = myLogHook pipe,
                  manageHook = myManageHook,
                  layoutHook = avoidStruts $ myLayoutHook,
                  handleEventHook = fullscreenEventHook,
                  focusFollowsMouse = False,
                  workspaces = myWorkspaces,
                  terminal = myTerminal,
                  modMask = myModMask,
                  keys = myWorkspaceKeys,
                  borderWidth = myBorderWidth,
                  normalBorderColor = myUnfocusedBorderColor,
                  focusedBorderColor = myFocusedBorderColor
                }

      main = xmonad . myConfig =<< spawnPipe "xmobar"

      -- programs
      myEditor = "editor -c"

      myTerminal = "terminal"

      myBrowser = "firefox"

      -- colors
      dark = "<<ui-dark-color()>>"

      highlight = "<<ui-fg-highlight-color()>>"

      muted = "<<ui-fg-muted-color()>>"

      foreground = "<<ui-fg-color()>>"

      primary = "#e8e8e8"

      urgent = "#fa7610"

      myFocusedBorderColor = "<<ui-dark-color()>>"

      myUnfocusedBorderColor = "<<ui-fg-color()>>"

      myPromptBorderColor = "<<ui-border-color()>>"

      -- config vars
      myBorderWidth = 2

      myPromptBorderWidth = 1

      myModMask = mod4Mask

      myWorkspaces = ["def", "web", "dev", "misc"]
    #+END_SRC

    Recompile and reload xmonad.

    #+BEGIN_SRC bash :results value
      xmonad --recompile && xmonad --restart
    #+END_SRC

    #+RESULTS:
    : 0

*** Status bar
    :PROPERTIES:
    :header-args+: :tangle ~/.status/status.scm
    :header-args+: :tangle-mode (identity #o755)
    :header-args:scheme: :session * status * :scheme guile
    :END:

    Auto-invoke guile.

    #+BEGIN_SRC text
      #!/usr/bin/guile \
      -e main -s
      !#
    #+END_SRC

    The actual scheme source for status. =geiser= can be used by evaling the below
    code block.

    #+BEGIN_SRC scheme
      (use-modules (ice-9 textual-ports))
      (use-modules (ice-9 popen))

      (define (file->string f)
        (call-with-input-file f
          (lambda (p)
            (get-string-all p))))

      (define (file->number f)
        (let ((s (file->string f)))
          (string->number (string-trim-both s))))

      (define (command->string command)
        (let* ((p (open-input-pipe command))
               (s (get-string-all p)))
          (close-pipe p)
          (string-trim-both s)))

      (define charge-full-f "/sys/class/power_supply/BAT0/charge_full")
      (define charge-now-f "/sys/class/power_supply/BAT0/charge_now")
      (define charge-status-f "/sys/class/power_supply/BAT0/status")

      (define (battery?)
        (file-exists? charge-full-f))

      (define (battery-status)
        (let ((s (string-trim-both (file->string charge-status-f))))
          (cond ((string= "Full" s) 'full)
                ((string= "Discharging" s) 'discharging)
                ((string= "Charging" s) 'charging)
                (else '()))))

      (define (battery-percent)
        (let ((full (file->number charge-full-f))
              (curr (file->number charge-now-f)))
          (floor (/ (* curr 100) full))))

      (define (volume-percent)
        (command->string "vol get"))

      (define (mute?)
        (let ((s (command->string "pamixer --get-mute")))
          (string=? s "true")))

      (define (essid)
        (command->string "essid"))

      (define (get-section-color)
        "Get the color that the section description should be formatted with."
        (or (getenv "STATUS_SECTION_COLOR") "#ffffff"))

      (define (format-section section value)
        (let ((color (get-section-color)))
          (format #f "<fc=~A> ~A:</fc> ~A" color section value)))

      (define (format-battery)
        (if (battery?)
            (let* ((status (battery-status))
                   (icon (cond ((eq? status 'discharging) " -")
                               ((eq? status 'charging) " +")
                               (else "")))
                   (s (format #f "~A%~A" (battery-percent) icon)))
              (format-section "bat" s))
            ""))

      (define (format-volume)
        (let* ((mute-str (if (mute?) " (mute)" ""))
               (s (format #f "~A%~A" (volume-percent) mute-str)))
          (format-section "vol" s)))

      (define (format-wifi)
        (format-section "wifi" (essid)))

      (define (format-status)
        (string-append
         (string-trim-both
          (string-join
           (list
            (format-wifi)
            (format-volume)
            (format-battery))
           "  "))
         " "))

      (define loop-wait 5)

      (define (print-loop)
        (while #t
          (display (format-status))
          (newline)
          (sleep loop-wait)))

      (define (main args)
        (setvbuf (current-output-port) 'none)
        (print-loop))
    #+END_SRC

    #+RESULTS:
    : #<unspecified>

** Nyxt

   I don't use nyxt as my primary browser, but it's fun to mess around with
   occasionally.

   Start the slynk server by running =start-slynk= in nyxt. This uses the
   default swank port of 4006. Connect to the slynk server by running
   =sly-connect= in Emacs.

   #+BEGIN_SRC lisp :tangle ~/.config/nyxt/init.lisp
     (defvar *custom-keymap* (make-keymap "custom-keymap")
       "Keymap containing all my custom keybinds.")

     (define-key *custom-keymap*
       "C-d" 'nyxt/web-mode:scroll-page-down
       "C-u" 'nyxt/web-mode:scroll-page-up)

     (define-mode custom-keymap-mode ()
       "Mode for using my custom keybinds."
       ((keymap-scheme (keymap:make-scheme
                        scheme:vi-normal *custom-keymap*))))

     (defvar *search-engines*
       (list '("google" "https://www.google.com/search?q=~a"))
       "List of search engines.")

     (define-configuration buffer
       ((default-modes (append '(nyxt::vi-normal-mode custom-keymap-mode blocker-mode) %slot-default%))
        (search-engines (append %slot-default%
                                (mapcar (lambda (engine) (apply 'make-search-engine engine))
                                        ,*search-engines*)))))

     (define-configuration prompt-buffer
       ((default-modes (append '(nyxt::vi-insert-mode) %slot-default%))))

     ;; Load up slynk.
     (push #p"~/.emacs.d/straight/build/sly/contrib/" asdf:*central-registry*)
     (push #p"~/.emacs.d/straight/build/sly/slynk/" asdf:*central-registry*)
     (asdf:load-system :slynk)

     (define-command-global start-slynk (&optional (slynk-port *swank-port*))
       "Start s Slynk server that can be connected to from Emacs via Sly."
       (slynk:create-server :port slynk-port :dont-close t))
   #+END_SRC

   #+RESULTS:
   : #<COMMAND START-SLYNK {1007CFE8CB}>
